public class Task1 {
//    Для успешного обучения из каждого набора заданий достаточно выполнить 1-2.
//            1.     Приветствовать любого пользователя при вводе его имени через командную строку.
//            2.     Отобразить в окне консоли аргументы командной строки в обратном порядке.
//            3.     Вывести заданное количество случайных чисел с переходом и без перехода на новую строку
//            4.     Ввести целые числа как аргументы командной строки, подсчитать их сумму (произведение) и вывести результат на консоль.

public static void main(String[] args) {


}

}
